#include<iostream>
#include<string>
#include<cstdio>
using namespace std;
string s;
int t[20];
int main(){
	freopen("number.in","r",stdin);
	freopen("number.out","w",stdout);
	cin>>s;
	for(int i=0;i<s.size();i++)
		if(s[i]>='0'&&s[i]<='9')
			t[s[i]-'0']++;
	for(int i=9;i>=0;i--)
		for(int j=0;j<t[i];j++)
			cout<<i;
	return 0;
}
/*
今天，是CSP-J复赛的日子。在考场里的我，敲完代码百无聊赖，遂在此，写下一些我的心事。
马上，11月13日，就是期中测验了。这次加了道法/历史。说实话，尽管我月考年级第7名，但我对
考试这个东西仍然没有太大信心，在这儿就不多说了，希望我能考好。
我感觉，我对未来没有什么规划。昨天做英语试卷，最后一题问我，Are you a 'p' person or a
'j' person? Why? 这题我写的是'p' person。因为我做小事都很有规划，但是在人生这种大事上
，我的规划却是一个尴尬的空白。那种意识到问题，却又无力改变的感觉，很难熬。
最后，不可避免的，我是八年级学生，正是情窦初开的时候。我发现，我现在已经实打实地，喜欢
上了她，不止因为她很漂亮，也不止因为她身上有一道勾人的香气，也因为她身上还是有一股童真
的气息。我喜欢。我曾经还是个gay，喜欢我同桌（男的），还幻想过做变性手术。但一切都已过
去，我想对她表白，但我又不敢。算了，就让这颗情感的种子，静静在我心中发芽吧。
最后的最后，草木会发芽，孩子会长大，岁月的列车不为谁停下，但我们在岁月静好里永葆真心。
祝你踏过千重浪，能留在爱人的身旁。祝在5号机的张起畅同学J组和S组都顺利，樊佳昕我喜欢你。
2025年11月1日11:17 白逸辰于上海市曹杨第二中学文萃楼613-28号机 
*/ 
