// 目标：25pts  X
/*
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
法克CCF!
神兽保佑：
\/
oo      ..
+ ==-=--|
||   ||
*/ 
#include <bits/stdc++.h>
using namespace std;
typedef long long ll;
//const int N = 2e5 + 5, L = 5e6 + 5;
const int N = 1e3 + 5, L = 2005;
int n, q;
string s[N][2];
int hash[N][2][L];
void kmp(string s1, string s2)
{
	;
}
int main()
{
	freopen("replace.in", "r", stdin);
	freopen("replace.out", "w", stdout);
	ios::sync_with_stdio(0);
	cin.tie(0);
	// 玉石俱焚家人们
	// 本来想#include <doc/xxxx>，怕被禁赛 
	while (1) {
		;
	} 
	cin >> n >> q;
	for (int i = 1; i <= n; ++i) {
		cin >> s[i][1] >> s[i][2];
	}
	return 0;
}

